Documents/СоставМедкомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СоставМедкомиссии</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СоставМедкомиссии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиЧленовКомиссии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СоставМедкомиссии/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);
	
	Если Объект.Ссылка.Пустая()
		И Объект.Состав.Количество() = 0
	Тогда
		Для Каждого РольИмя Из Метаданные.Справочники.РолиЧленовКомиссии.ПолучитьИменаПредопределенных() Цикл
			Если РольИмя <> "ЧленКомиссии" Тогда
				Объект.Состав.Добавить().Роль = Справочники.РолиЧленовКомиссии[РольИмя];
			КонецЕсли;
	    КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	УстановитьЗначенияПоУмолчаниюДолжностямИСпециальностямСотрудника();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для Каждого эл Из Объект.Состав Цикл 
		СтруктураПоиска = Новый Структура("Роль, Специализация");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, эл);
		
		Если Объект.Состав.НайтиСтроки(СтруктураПоиска).Количество() > 1 Тогда
			ТекстПедупреждения = НСтр("ru = 'Сотрудник с такой ролью и специализацией уже добавлен в состав комиссии!'");
			Предупреждение(ТекстПедупреждения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СоставПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.Состав.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		Если ТекДанные.НомерСтроки = 1 Тогда
			ТекДанные.Роль = ПредопределенноеЗначение("Справочник.РолиЧленовКомиссии.Председатель");
		Иначе
			ТекДанные.Роль = ПредопределенноеЗначение("Справочник.РолиЧленовКомиссии.ЧленКомиссии");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставСотрудникПриИзменении(Элемент)
	
	ТекДанные = Элементы.Состав.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьЗначенияПоУмолчаниюДолжностямИСпециальностямСотрудника(ТекДанные);
	СоставПриАктивизацииСтроки(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Функция ПолучитьВсеДолжностиИСпециализацииВрача(Врач)
	
	СтруктураВозврата = Новый Структура; 
	СтруктураВозврата.Вставить("Должности", ИнтеграцияЕГИСЗВызовСервера.ДолжностиМЗ(Врач));
	СтруктураВозврата.Вставить("Специализации", ПроцедурыСпециализацииПоставки.ПолучитьМассивСпециализацийСотрудника(Врач));
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗначенияПоУмолчаниюДолжностямИСпециальностямСотрудника(СтрокаДляИзмененияОтборов = Неопределено)
	
	// Перезаполнение одной переданной строки
	Если СтрокаДляИзмененияОтборов <> Неопределено Тогда
		ПерезаполнитьОтборыИЗначенияПоУмолчанию(СтрокаДляИзмененияОтборов, Истина);
		Возврат;
	КонецЕсли;
	// Перезаполнение всей таблицы
	Для Каждого СтрокаСостава Из Объект.Состав Цикл
		Если Не ЗначениеЗаполнено(СтрокаСостава.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		ПерезаполнитьОтборыИЗначенияПоУмолчанию(СтрокаСостава);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьОтборыИЗначенияПоУмолчанию(СтрокаСостава, ПринудительноПерезаполнить = Ложь)
	
	ДолжностиИСпециализацииВрача = ПолучитьВсеДолжностиИСпециализацииВрача(СтрокаСостава.Сотрудник);
	
	Если (ПринудительноПерезаполнить 
		Или Не ЗначениеЗаполнено(СтрокаСостава.Должность)) 
		И ДолжностиИСпециализацииВрача.Должности.Количество() <> 0 
		Тогда
		СтрокаСостава.Должность = ДолжностиИСпециализацииВрача.Должности[0];
	КонецЕсли;
	
	Если (ПринудительноПерезаполнить 
		Или Не ЗначениеЗаполнено(СтрокаСостава.Специализация)) 
		И ДолжностиИСпециализацииВрача.Специализации.Количество() <> 0 
		Тогда
		СтрокаСостава.Специализация = ДолжностиИСпециализацииВрача.Специализации[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Состав.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Сотрудник = Элементы.Состав.ТекущиеДанные.Сотрудник;
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ДолжностиИСпециализацииСотрудника = ПолучитьВсеДолжностиИСпециализацииВрача(Сотрудник);
		ДолжностиСотрудника = ДолжностиИСпециализацииСотрудника.Должности;
		СпециализацииСотрудника = ДолжностиИСпециализацииСотрудника.Специализации; 
	Иначе
		СпециализацииСотрудника = Новый Массив;
		ДолжностиСотрудника = Новый Массив;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Массив;
	ПараметрыОтбора.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ДолжностиРаботниковМедОрганизаций")));
	ПараметрыОтбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", ДолжностиСотрудника));
	Элементы.СоставДолжность.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыОтбора);
	
	ПараметрыОтбора = Новый Массив;
	ПараметрыОтбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", СпециализацииСотрудника));
	Элементы.СоставСпециализация.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыОтбора);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

#КонецОбласти
